class script(object):
    START_TXT = """𝖧𝗂𝖨 𝖨 𝖺𝗆 🅟︎🅗︎🅘︎🅛︎🅘︎🅟︎ <a href='https://te.legra.ph/file/af20d5a6b83adab0a6346.jpg'> </a>

𝖨'𝗆 𝖺 𝖴𝗌𝖾𝗋-𝖥𝗋𝗂𝖾𝗇𝖽𝗅𝗒 𝗀𝗋𝗈𝗎𝗉 𝖬𝖺𝗇𝖺𝗀𝖾𝗋 

➢ <b>Build Version:</b> <code>V2.1.0 [BETA]</code>
➢ <b>Speciality:</b> <code>Movie Provider</code>

𝖢𝗅𝗂𝖼𝗄 <b>𝖧𝖾𝗅𝗉</b> 𝗍𝗈 𝗆𝗒 𝖥𝗎𝗇𝖼𝗍𝗂𝗈𝗇𝗌"""

    HELP_TXT = """𝖶𝖺𝗌𝗌𝗎𝗉 {},

/about: 𝖳𝗈 𝗄𝗇𝗈𝗐 𝗆𝗒 𝖽𝖾𝗍𝖺𝗂𝗅𝗌

𝚃𝙰𝙿 𝙾𝙽 𝙴𝙰𝙲𝙷 𝙼𝙾𝙳𝚄𝙻𝙴 𝚃𝙾 𝙶𝙴𝚃 𝚃𝙷𝙴 𝙳𝙴𝚃𝙰𝙸𝙻𝚂 ✨."""
    HELPTWO_TXT = """𝖧𝖾𝗒 {},

/about: 𝖳𝗈 𝗄𝗇𝗈𝗐 𝗆𝗒 𝖽𝖾𝗍𝖺𝗂𝗅𝗌

𝖧𝖾𝗋𝖾 𝗂𝗌 𝗍𝗁𝖾 𝗌𝖾𝖼𝗈𝗇𝖽 𝗉𝖺𝗀𝖾 𝗈𝖿 𝗆𝗒 <b>𝖧𝖾𝗅𝗉</b> 𝖬𝗈𝖽𝗎𝗅𝖾.

𝚃𝙰𝙿 𝙾𝙽 𝙴𝙰𝙲𝙷 𝙼𝙾𝙳𝚄𝙻𝙴 𝚃𝙾 𝙶𝙴𝚃 𝚃𝙷𝙴 𝙳𝙴𝚃𝙰𝙸𝙻𝚂 ✨."""

    ABOUT_TXT = """

➢ 𝐌𝐲 𝐍𝐚𝐦𝐞: 𝖯𝗁𝗂𝗅𝗂𝗉 𝖩 𝖢𝗈𝗎𝗅𝗌𝗈𝗇
    
➢ 𝐌𝐲 𝐂𝐫𝐞𝐚𝐭𝐨𝐫: <a href='tg://user?id=1617258761'>🅓︎🅞︎🅝︎ [𝖲𝖿𝗅𝗂𝗑]</a>

➢ 𝐌𝐲 𝐒𝐨𝐮𝐫𝐜𝐞: <a href='https://github.com/EvamariaTG/EvaMaria'>𝖤𝗏𝖺 𝖬𝖺𝗋𝗂𝖺</a>

➢ 𝐌𝐲 𝐋𝐢𝐛𝐫𝐚𝐫𝐲: 𝖯𝗒𝗋𝗈𝗀𝗋𝖺𝗆

➢ 𝐌𝐲 𝐋𝐚𝐧𝐠𝐮𝐚𝐠𝐞: 𝖯𝗒𝗍𝗁𝗈𝗇3

➢ 𝐌𝐲 𝐃𝐚𝐭𝐚𝐛𝐚𝐬𝐞: 𝖬𝗈𝗇𝗀𝗈 𝖣𝖡 

➢ 𝐌𝐲 𝐒𝐞𝐫𝐯𝐞𝐫: 𝖧𝖾𝗋𝗈𝗄𝗎

➢ 𝐌𝐲 𝐔𝐩𝐝𝐚𝐭𝐞𝐬: <a href='https://t.me/SflixBots'>𝖲𝖿𝗅𝗂𝗑 𝖡𝗈𝗍𝗌</a>

➢ 𝐌𝐲 𝐒𝐮𝐩𝐩𝐨𝐫𝐭: <a href='https://t.me/TameSflix'>𝖲𝖿𝗅𝗂𝗑 𝖲𝗎𝗉𝗉𝗈𝗋𝗍</a>

➤ 𝙸𝚏 𝚢𝚘𝚞 𝚕𝚒𝚔𝚎 𝚝𝚑𝚒𝚜 𝚋𝚘𝚝 𝚙𝚕𝚎𝚊𝚜𝚎 𝚜𝚑𝚊𝚛𝚎 𝚊𝚗𝚍 𝚜𝚞𝚙𝚙𝚘𝚛𝚝 𝚞𝚜 <a href='https://t.me/Phil_Coulson_Sflix_bot?start=DSTORE-MTc5Ml8xNzkzXy0xMDAxNzEyMzE2Mzc0'>⚡</a>"""

    MANUALFILTER_TXT = """➤ 𝐇𝐞𝐥𝐩: 𝖬𝖺𝗇𝗎𝖺𝗅-𝖥𝗂𝗅𝗍𝖾𝗋.

➤ 𝐍𝐨𝐭𝐞:
1. 𝖬𝖺𝗄𝖾 𝗆𝖾 𝖺𝗇 𝖠𝖽𝗆𝗂𝗇 𝗂𝗇 𝗒𝗈𝗎𝗋 𝗀𝗋𝗈𝗎𝗉.
2. 𝖮𝗇𝗅𝗒 𝗍𝗁𝖾 𝗀𝗋𝗈𝗎𝗉 𝖠𝖽𝗆𝗂𝗇𝗌 𝖼𝖺𝗇 𝖺𝖽𝖽 𝖿𝗂𝗅𝗍𝖾𝗋𝗌.
3. 𝖠𝗅𝖾𝗋𝗍 𝖻𝗎𝗍𝗍𝗈𝗇 𝗅𝗂𝗆𝗂𝗍: 64 𝖼𝗁𝖺𝗋𝖺𝖼𝗍𝖾𝗋𝗌.

➤ 𝖬𝖺𝗇𝗎𝖺𝗅-𝖥𝗂𝗅𝗍𝖾𝗋 𝖼𝗈𝗆𝗆𝖺𝗇𝖽𝗌:
➪/add 𝗈𝗋 /filter - 𝖳𝗈 𝖺𝖽𝖽 𝖺 𝖥𝗂𝗅𝗍𝖾𝗋 𝗂𝗇 𝗍𝗁𝖾 𝗀𝗋𝗈𝗎𝗉.
➪/filters 𝗈𝗋 /viewfilters - 𝖳𝗈 𝗅𝗂𝗌𝗍 𝖺𝗅𝗅 𝗍𝗁𝖾 𝖿𝗂𝗅𝗍𝖾𝗋𝗌 𝗂𝗇 𝗍𝗁𝖾 𝗀𝗋𝗈𝗎𝗉.
➪/del - 𝖳𝗈 𝖽𝖾𝗅𝖾𝗍𝖾 𝖺 𝗌𝗉𝖾𝖼𝗂𝖿𝗂𝖼 𝖿𝗂𝗅𝗍𝖾𝗋.
➪/delall - 𝖳𝗈 𝖽𝖾𝗅𝖾𝗍𝖾 𝖺𝗅𝗅 𝗍𝗁𝖾 𝖿𝗂𝗅𝗍𝖾𝗋𝗌 𝗂𝗇 𝗍𝗁𝖾 𝗀𝗋𝗈𝗎𝗉.[𝖦𝖱𝖮𝖴𝖯 𝖮𝖶𝖭𝖤𝖱𝖲 𝖮𝖭𝖫𝖸]"""

    BUTTON_TXT = """➤ 𝐇𝐞𝐥𝐩: 𝖡𝖴𝖳𝖳𝖮𝖭𝖲.

➪ 𝖨 𝗌𝗎𝗉𝗉𝗈𝗋𝗍 𝖻𝗈𝗍𝗁 𝖴𝖱𝖫 & 𝖠𝖫𝖤𝖱𝖳 𝗂𝗇𝗅𝗂𝗇𝖾 𝖻𝗎𝗍𝗍𝗈𝗇𝗌.

➤ 𝐍𝐨𝐭𝐞:
1. 𝖳𝖾𝗅𝖾𝗀𝗋𝖺𝗆 𝗐𝗂𝗅𝗅 𝗇𝗈𝗍 𝖺𝗅𝗅𝗈𝗐𝗌 𝗒𝗈𝗎 𝗍𝗈 𝗌𝖾𝗇𝖽 𝖻𝗎𝗍𝗍𝗈𝗇𝗌 𝗐𝗂𝗍𝗁𝗈𝗎𝗍 𝖺𝗇𝗒 𝖼𝗈𝗇𝗍𝖾𝗇𝗍, 𝗌𝗈 𝖼𝗈𝗇𝗍𝖾𝗇𝗍 𝗂𝗌 𝗆𝖺𝗇𝖽𝖺𝗍𝗈𝗋𝗒.
2. 𝖨 𝗌𝗎𝗉𝗉𝗈𝗋𝗍 𝖻𝗎𝗍𝗍𝗈𝗇𝗌 𝗐𝗂𝗍𝗁 𝖺𝗇𝗒 𝗍𝖾𝗅𝖾𝗀𝗋𝖺𝗆 𝗆𝖾𝖽𝗂𝖺 𝗍𝗒𝗉𝖾.
3. 𝖡𝗎𝗍𝗍𝗈𝗇𝗌 𝗌𝗁𝗈𝗎𝗅𝖽 𝖻𝖾 𝗉𝗋𝗈𝗉𝖾𝗋𝗅𝗒 𝗉𝖺𝗋𝗌𝖾𝖽 𝖺𝗌 𝗆𝖺𝗋𝗄𝖽𝗈𝗐𝗇 𝖿𝗈𝗋𝗆𝖺𝗍.

➤ 𝐔𝐑𝐋 𝐁𝐮𝐭𝐭𝐨𝐧𝐬:
[𝖡𝗎𝗍𝗍𝗈𝗇 𝖳𝖾𝗑𝗍](buttonurl:𝗁𝗍𝗍𝗉𝗌://𝗍.𝗆𝖾/Sflix2kchats)

➤ 𝐀𝐋𝐄𝐑𝐓 𝐁𝐮𝐭𝐭𝐨𝐧𝐬:
[𝖡𝗎𝗍𝗍𝗈𝗇 𝖳𝖾𝗑𝗍](buttonalert: Your text)"""

    AUTOFILTER_TXT = """➤ 𝐇𝐞𝐥𝐩: 𝐀𝐮𝐭𝐨-𝐅𝐢𝐥𝐭𝐞𝐫.

𝙰𝚞𝚝𝚘𝚏𝚒𝚕𝚝𝚎𝚛 𝚒𝚜 𝚊 𝚏𝚎𝚊𝚝𝚞𝚛𝚎 𝚒𝚗 𝚠𝚑𝚒𝚌𝚑 𝙸 𝚛𝚎𝚜𝚙𝚘𝚗𝚍 𝚝𝚘 𝚝𝚑𝚎 𝚚𝚞𝚎𝚛𝚒𝚎𝚜 𝚒𝚗 𝚝𝚑𝚎 𝚐𝚛𝚘𝚞𝚙 𝚠𝚒𝚝𝚑 𝚝𝚑𝚎 𝙼𝚘𝚟𝚒𝚎/𝚂𝚎𝚛𝚒𝚎𝚜 𝚏𝚒𝚕𝚎𝚜 𝚜𝚝𝚘𝚛𝚎𝚍 𝚒𝚗 𝚖𝚢 𝙳𝚊𝚝𝚊𝚋𝚊𝚜𝚎 🌩️.

➤ 𝐂𝐨𝐦𝐦𝐚𝐧𝐝𝐬 & 𝐔𝐬𝐚𝐠𝐞:

➢ /autofilter on/off: 𝖳𝗈 𝗍𝗎𝗋𝗇 𝖮𝖭 𝖺𝗇𝖽 𝗍𝗎𝗋𝗇 𝖮𝖥𝖥 𝗍𝗁𝖾 𝖠𝗎𝗍𝗈𝖿𝗂𝗅𝗍𝖾𝗋 𝖥𝖾𝖺𝗍𝗎𝗋𝖾.
   ➢ /autofilter: To check the current settings.

➤ 𝐍𝐨𝐭𝐞:

❍ 𝖠𝖽𝖽 𝗆𝖾 𝗍𝗈 𝗒𝗈𝗎𝗋 𝗀𝗋𝗈𝗎𝗉 & 𝗆𝖺𝗄𝖾 𝗆𝖾 𝖺𝗇 𝖠𝖽𝗆𝗂𝗇. 𝖠𝗇𝖽 𝗍𝗎𝗋𝗇 𝗈𝗇 𝖺𝗎𝗍𝗈𝖿𝗂𝗅𝗍𝖾𝗋.

𝖬𝖺𝖽𝖾 𝖻𝗒 @CLaY995"""

    CONNECTION_TXT = """➤ 𝐇𝐞𝐥𝐩: 𝖢𝗈𝗇𝗇𝖾𝖼𝗍𝗂𝗈𝗇𝗌.

- 𝖴𝗌𝖾𝖽 𝗍𝗈 𝖼𝗈𝗇𝗇𝖾𝖼𝗍 𝖻𝗈𝗍 𝗍𝗈 𝖯𝖬 𝖿𝗈𝗋 𝗆𝖺𝗇𝖺𝗀𝗂𝗇𝗀 𝖿𝗂𝗅𝗍𝖾𝗋𝗌 
- 𝗂𝗍 𝗁𝖾𝗅𝗉𝗌 𝗍𝗈 𝖺𝗏𝗈𝗂𝖽 𝗌𝗉𝖺𝗆𝗆𝗂𝗇𝗀 𝗂𝗇 𝗀𝗋𝗈𝗎𝗉𝗌.

➤ 𝐍𝐨𝐭𝐞:
1. 𝖮𝗇𝗅𝗒 𝖺𝖽𝗆𝗂𝗇𝗌 𝖼𝖺𝗇 𝖺𝖽𝖽 𝖺 𝖼𝗈𝗇𝗇𝖾𝖼𝗍𝗂𝗈𝗇.
2. 𝖲𝖾𝗇𝖽 /connect 𝖿𝗈𝗋 𝖼𝗈𝗇𝗇𝖾𝖼𝗍𝗂𝗇𝗀 𝗆𝖾 𝗍𝗈 𝗎𝗋 𝖯𝖬.

➤ 𝐂𝐨𝐦𝐦𝐚𝐧𝐝𝐬 & 𝐔𝐬𝐚𝐠𝐞:

➪/connect: 𝖳𝗈 𝖼𝗈𝗇𝗇𝖾𝖼𝗍 𝖺 𝗀𝗋𝗈𝗎𝗉 𝗍𝗈 𝗒𝗈𝗎𝗋 𝖯𝖬.
➪/disconnect: 𝖳𝗈 𝖽𝗂𝗌𝖼𝗈𝗇𝗇𝖾𝖼𝗍 𝖿𝗋𝗈𝗆 𝖺 𝗀𝗋𝗈𝗎𝗉.
➪/connections: 𝖳𝗈 𝗅𝗂𝗌𝗍 𝖺𝗅𝗅 𝗒𝗈𝗎𝗋 𝖼𝗈𝗇𝗇𝖾𝖼𝗍𝗂𝗈𝗇𝗌."""

    AUTO_MANUAL_TXT = """➤ 𝐇𝐞𝐥𝐩: 𝖥𝗂𝗅𝗍𝖾𝗋𝗌

𝚂𝚎𝚕𝚎𝚌𝚝 𝚝𝚑𝚎 𝚏𝚒𝚕𝚝𝚎𝚛 𝚝𝚢𝚙𝚎 𝚢𝚘𝚞 𝚠𝚊𝚗𝚝 𝚋𝚎𝚕𝚘𝚠💫"""

    INFO_TXT = """➤ 𝐇𝐞𝐥𝐩: 𝖨𝗇𝖿𝗈

𝚆𝚒𝚝𝚑 𝚝𝚑𝚎𝚜𝚎 𝚌𝚘𝚖𝚖𝚊𝚗𝚍𝚜 𝙸 𝚌𝚊𝚗 𝚏𝚎𝚝𝚌𝚑 𝚝𝚑𝚎 𝚞𝚜𝚎𝚛 𝚍𝚎𝚝𝚊𝚒𝚕𝚜 𝚜𝚞𝚌𝚑 𝚊𝚜: 𝚄𝚜𝚎𝚛 𝙸𝙳, 𝚄𝚜𝚎𝚛 𝙳𝙿, 𝚄𝚜𝚎𝚛 𝙳𝙲, 𝚄𝚜𝚎𝚛 𝙽𝚊𝚖𝚎𝚜, 𝚎𝚝𝚌. 𝙰𝚕𝚜𝚘 𝚞𝚜𝚎 𝚝𝚑𝚒𝚜 𝚌𝚘𝚖𝚖𝚊𝚗𝚍 𝚝𝚘 𝚏𝚎𝚝𝚌𝚑 𝚐𝚛𝚘𝚞𝚙 𝙸𝙳'𝚜 👤.

➤ 𝐂𝐨𝐦𝐦𝐚𝐧𝐝𝐬 𝐚𝐧𝐝 𝐔𝐬𝐚𝐠𝐞:

➪/id: 𝖳𝗈 𝗀𝖾𝗍 𝗍𝗁𝖾 𝖨𝖣 𝗈𝖿 𝖺 𝗎𝗌𝖾𝗋.
➪/info: 𝖳𝗈 𝗀𝖾𝗍 𝗂𝗇𝖿𝗈 𝖺𝖻𝗈𝗎𝗍 𝖺 𝗎𝗌𝖾𝗋."""

    SEARCH_TXT = """➤ 𝐇𝐞𝐥𝐩: IMDB.

𝚆𝚒𝚝𝚑 𝚝𝚑𝚒𝚜 𝙼𝚘𝚍𝚞𝚕𝚎 𝙸 𝚌𝚊𝚗 𝚏𝚎𝚝𝚌𝚑 𝙼𝚘𝚟𝚒𝚎/𝚂𝚎𝚛𝚒𝚎𝚜 𝚍𝚎𝚝𝚊𝚒𝚕𝚜 𝚏𝚛𝚘𝚖 𝙸𝙼𝙳𝚋. 𝚃𝚑𝚒𝚜 𝚌𝚘𝚖𝚖𝚊𝚗𝚍 𝚒𝚜 𝚊𝚕𝚜𝚘 𝙰𝚙𝚙𝚕𝚒𝚌𝚊𝚋𝚕𝚎 𝚒𝚗 𝙲𝚑𝚊𝚗𝚗𝚎𝚕𝚜. 𝙹𝚞𝚜𝚝 𝚖𝚊𝚔𝚎 𝚖𝚎 𝚊𝚗 𝙰𝚍𝚖𝚒𝚗 𝚒𝚗 𝚢𝚘𝚞𝚛 𝚌𝚑𝚊𝚗𝚗𝚎𝚕 𝚊𝚗𝚍 𝙶𝚒𝚟𝚎 𝚞𝚜𝚎 𝚝𝚑𝚎 𝚌𝚘𝚖𝚖𝚊𝚗𝚍 ✨.

➤ 𝐂𝐨𝐦𝐦𝐚𝐧𝐝𝐬 𝐚𝐧𝐝 𝐔𝐬𝐚𝐠𝐞:

➪/imdb: 𝖳𝗈 𝗀𝖾𝗍 𝖺 𝖿𝗂𝗅𝗆 𝗂𝗇𝖿𝗈 𝖿𝗋𝗈𝗆 𝖨𝖬𝖣𝖻.
➪/search: 𝖳𝗈 𝗀𝖾𝗍 𝖿𝗂𝗅𝗆 𝗂𝗇𝖿𝗈 𝖿𝗋𝗈𝗆 𝗏𝖺𝗋𝗂𝗈𝗎𝗌 𝗌𝗈𝗎𝗋𝖼𝖾𝗌."""

    ADMIN_TXT = """➤ 𝐇𝐞𝐥𝐩: 𝖠𝖽𝗆𝗂𝗇𝗌

𝚃𝚑𝚎𝚜𝚎 𝚊𝚛𝚎 𝚝𝚑𝚎 𝚌𝚘𝚖𝚖𝚊𝚗𝚍𝚜 𝚊 𝚐𝚛𝚘𝚞𝚙 𝚊𝚍𝚖𝚒𝚗 𝚌𝚊𝚗 𝚞𝚜𝚎 𝚝𝚘 𝚌𝚞𝚜𝚝𝚘𝚖𝚒𝚜𝚎 𝚝𝚑𝚎 𝚋𝚘𝚝 𝚊𝚜 𝚝𝚑𝚎𝚒𝚛 𝚠𝚒𝚜𝚑.

➤ 𝐂𝐨𝐦𝐦𝐚𝐧𝐝𝐬 𝐚𝐧𝐝 𝐔𝐬𝐚𝐠𝐞:

➪ /set_template: 𝖳𝗒𝗉𝖾 𝗍𝗁𝗂𝗌 𝖼𝗈𝗆𝗆𝖺𝗇𝖽 𝗐𝗂𝗍𝗁 𝗒𝗈𝗎𝗋 𝗇𝖾𝗐 𝖳𝖾𝗆𝗉𝗅𝖺𝗍𝖾 𝗍𝗈 𝗌𝖾𝗍 𝗇𝖾𝗐 𝖼𝗎𝗌𝗍𝗈𝗆𝗂𝗌𝖾𝖽 𝖨𝖬𝖣𝖡 𝖳𝖾𝗆𝗉𝗅𝖺𝗍𝖾.

➛𝖤𝗑𝖺𝗆𝗉𝗅𝖾:
/set_template
<b>🏷 Title</b>: <a href={url}>{title}</a>
🎭 Genres: {genres}
📆 Year: <a href={url}/releaseinfo>{year}</a>"""

    STATUS_TXT = """➪ <b>Total Files:</b> <code>{}</code>

➪ <b>Total Users:</b> <code>{}</code>

➪ <b>Total Chats:</b> <code>{}</code>

➪ <b>Used Storage:</b> <code>{}</code> 

➪ <b>Free Storage:</b> <code>{}</code> """

    FILE_TXT = """➤ 𝐇𝐞𝐥𝐩: 𝖥𝗂𝗅𝖾 𝖲𝗍𝗈𝗋𝖾

𝚆𝚒𝚝𝚑 𝚝𝚑𝚒𝚜 𝚌𝚘𝚖𝚖𝚊𝚍𝚜 𝚒 𝚌𝚊𝚗 𝚜𝚝𝚘𝚛𝚎 𝚏𝚒𝚕𝚎𝚜 𝚊𝚗𝚍 𝚐𝚒𝚟𝚎 𝚢𝚘𝚞 𝚊 𝚜𝚑𝚊𝚛𝚎𝚊𝚋𝚕𝚎 𝚕𝚒𝚗𝚔 𝚠𝚒𝚝𝚑 𝚝𝚑𝚒𝚜 𝚕𝚒𝚗𝚔 𝚒 𝚌𝚊𝚗 𝚜𝚑𝚊𝚛𝚎 𝚝𝚑𝚊𝚝 𝚏𝚒𝚕𝚎𝚜 𝚢𝚘𝚞 𝚐𝚒𝚟𝚎 𝚖𝚎 𝚏𝚛𝚘𝚖 𝚊𝚗𝚢 𝚌𝚑𝚊𝚗𝚗𝚎𝚕 𝚠𝚒𝚝𝚑𝚘𝚞𝚝 𝚊𝚍𝚍𝚒𝚗𝚐 𝚖𝚎

➤ 𝐂𝐨𝐦𝐦𝐚𝐧𝐝𝐬 𝐚𝐧𝐝 𝐔𝐬𝐚𝐠𝐞:

➪ /plink - 𝖱𝖾𝗉𝗅𝗒 𝗍𝗈 𝖺𝗇𝗒 𝗆𝖾𝖽𝗂𝖺 𝗍𝗈 𝗀𝖾𝗍 𝗅𝗂𝗇𝗄
➪ /pbatch - 𝖴𝗌𝖾 𝗒𝗈𝗎𝗋 𝗆𝖺𝖽𝗂𝖺 𝗅𝗂𝗇𝗄 𝗐𝗂𝗍𝗁 𝗍𝗁𝗂𝗌 𝖼𝗈𝗆𝗆𝖺𝗇𝖽

➛𝖤𝗑𝖺𝗆𝗉𝗅𝖾:
/pbatch <code>https://t.me/Sflix2k/497 https://t.me/Sflix2k/498</code>"""

    FORCESUB_TXT = """Okda"""

    LOG_TEXT_G = """#NewGroup
Group = @{} (<code>{}</code>)
Total Members = <code>{}</code>
Added By - {}
"""

    LOG_TEXT_P = """#NewUser
ID - <code>{}</code>
Name - {}"""

    SPELLINGCHECK_TXT = """𝖣𝖾𝖺𝗋 {} 🤕,

𝖣𝗈𝗇'𝗍 𝗎𝗌𝖾 𝗐𝗈𝗋𝖽𝗌 𝗅𝗂𝗄𝖾:
(𝖬𝖺𝗅𝖺𝗒𝖺𝗅𝖺𝗆 𝗆𝗈𝗏𝗂𝖾 | 𝖳𝖺𝗆𝗂𝗅 𝗆𝗈𝗏𝗂𝖾 | 𝖧𝗂𝗇𝖽𝗂 𝗆𝗈𝗏𝗂𝖾), (𝖪𝗂𝗍𝗍𝗎𝗈 | 𝖳𝗁𝖺𝗋𝗎𝗈), 𝖾𝗍𝖼.

⚙️ <b>Nᴏᴛᴇ:</b>  𝖨𝖿 𝗒𝗈𝗎 𝗌𝗍𝗂𝗅𝗅 𝖽𝗈𝗇'𝗍 𝗀𝖾𝗍 𝗍𝗁𝖾 𝗆𝗈𝗏𝗂𝖾 𝗍𝗁𝖾𝗇 𝗆𝖺𝗄𝖾 𝗌𝗎𝗋𝖾 𝗍𝗁𝖺𝗍 𝗍𝗁𝖾 𝖬𝗈𝗏𝗂𝖾 𝗂𝗌 𝗋𝖾𝗅𝖾𝖺𝗌𝖾𝖽 𝗈𝗇 <b>𝖮𝖳𝖳 𝗉𝗅𝖺𝗍𝖿𝗈𝗋𝗆𝗌.</b> 𝖡𝖾𝖼𝖺𝗎𝗌𝖾 𝗍𝗁𝗂𝗌 𝖻𝗈𝗍 𝖽𝗈𝗇'𝗍 𝗉𝗋𝗈𝗏𝗂𝖽𝖾 <b>𝖯𝗋𝖾𝖣𝖵𝖣</b> 𝖿𝗂𝗅𝖾𝗌 𝗂𝖾., 𝖢𝖺𝗆𝖾𝗋𝖺 𝗉𝗋𝗂𝗇𝗍𝗌."""

    MOVIENOTFOUND_TXT = """<b>➲ 𝖸𝗈𝗎𝗋 𝖱𝖾𝗊𝗎𝖾𝗌𝗍:<b> {}
<b>➲ 𝖱𝖾𝗊𝗎𝖾𝗌𝗍𝖾𝖽 𝖻𝗒:</b> {}
<b>➲ Status:</b> #NotFound.

➜ Report to Admins: <b>/report</b>

<b>Check your spelling in Google</b> ⬇"""

    ANYFILECAPTION_TXT = """**File Name:**
`{file_name}`         

**Size:** `{file_size}`

`This File will be deleted after 10 minutes!`"""


    ADMINS_GROUP_TXT = """

Here is the help for the Admin module:

Make it easy to promote and demote users with the admin module!

User Commands:
× /adminlist: List the admins in the current chat.

Admin Commands:
× /promote <reply/username/mention/userid>: Promote a user.
× /demote <reply/username/mention/userid>: Demote a user.
× /title <reply/username/mention/userid> <custom title>: Set custom title for user.
"""

BAN_TXT = """
Here is the help for the Bans module:

Sometimes users can be annoying and you might want to remove them from your chat, this module exactly helps you to deal with that!.
Ban/kick usersfrom your chat, and unban them later on if they're behaving themselves.

User Commands:
× /kickme: kicks the user who issued the command.

Ban Commands (Admin only):
× /ban <userhandle>: bans a user. (via handle, or reply)
× /sban <userhandle>: bans a user silently, does not send message to group and also deletes your command. (via handle, or reply)
× /dban <userhandle>: bans a user and delete the replied message. (via handle, or reply)
× /tban <userhandle> x(m/h/d): bans a user for x time. (via handle, or reply). m = minutes, h = hours, d = days.
× /unban <userhandle>: unbans a user. (via handle, or reply)

Restrict Commands: (Admin only)
× /restrict: Shows an InlineKeyboard to choose options from kick, ban and mute
× /unrestrict: Shows an InlineKeyboard to choose options from unmute and unban.
"""
